In [2]:
!conda install -yc conda-forge ipython-sql

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: D:\Anaconda3\Anaconda3

==> WARNING: A newer version of conda exists. <==
  current version: 4.9.2
  latest version: 4.10.1

Please update conda by running

    $ conda update -n base -c defaults conda

  added / updated specs:
    - ipython-sql


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.10.1               |   py38haa244fe_0         3.1 MB  conda-forge
    ipython-sql-0.3.9          |py38h32f6830_1002          28 KB  conda-forge
    prettytable-2.1.0          |     pyhd8ed1ab_0          23 KB  conda-forge
    python_abi-3.8             |           1_cp38           4 KB  conda-forge
    sqlparse-0.4.1             |     pyh9f0ad1d_0          34 KB  conda-forge
    ------------------------------------------------------------
                                           Total:         3.2 MB

The following NEW packages will be INSTALLED:

  ipython-sql        conda-forge/win-64::ipython-sql-0.3.9-py38h32f6830_1002
  prettytable        conda-forge/noarch::prettytable-2.1.0-pyhd8ed1ab_0
  python_abi         conda-forge/win-64::python_abi-3.8-1_cp38
  sqlparse           conda-forge/noarch::sqlparse-0.4.1-pyh9f0ad1d_0

The following packages will be UPDATED:

  conda               pkgs/main::conda-4.9.2-py38haa95532_0 --> conda-forge::conda-4.10.1-py38haa244fe_0



Downloading and Extracting Packages

prettytable-2.1.0    | 23 KB     |            |   0%
prettytable-2.1.0    | 23 KB     | #######1   |  71%
prettytable-2.1.0    | 23 KB     | ########## | 100%

conda-4.10.1         | 3.1 MB    |            |   0%
conda-4.10.1         | 3.1 MB    | 3          |   3%
conda-4.10.1         | 3.1 MB    | #7         |  17%
conda-4.10.1         | 3.1 MB    | #####4     |  55%
conda-4.10.1         | 3.1 MB    | #########4 |  95%
conda-4.10.1         | 3.1 MB    | ########## | 100%

ipython-sql-0.3.9    | 28 KB     |            |   0%
ipython-sql-0.3.9    | 28 KB     | #####7     |  58%
ipython-sql-0.3.9    | 28 KB     | ########## | 100%

python_abi-3.8       | 4 KB      |            |   0%
python_abi-3.8       | 4 KB      | ########## | 100%

sqlparse-0.4.1       | 34 KB     |            |   0%
sqlparse-0.4.1       | 34 KB     | ####7      |  48%
sqlparse-0.4.1       | 34 KB     | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

In [5]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [7]:
conda update -n base -c defaults conda

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: D:\Anaconda3\Anaconda3

  added / updated specs:
    - conda
Note: you may need to restart the kernel to use updated packages.



The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    backports.functools_lru_cache-1.6.4|     pyhd3eb1b0_0           9 KB
    backports.tempfile-1.0     |     pyhd3eb1b0_1          11 KB
    conda-4.10.1               |   py38haa95532_1         2.9 MB
    conda-package-handling-1.7.3|   py38h8cc25b3_1         721 KB
    sqlparse-0.4.1             |             py_0          35 KB
    ------------------------------------------------------------
                                           Total:         3.6 MB

The following packages will be UPDATED:

  backports.functoo~                             1.6.1-py_0 --> 1.6.4-pyhd3eb1b0_0
  conda              conda-forge::conda-4.10.1-py38haa244f~ --> pkgs/main::conda-4.10.1-py38haa95532_1
  conda-package-han~                   1.7.2-py38h76e460a_0 --> 1.7.3-py38h8cc25b3_1

The following packages will be SUPERSEDED by a higher-priority channel:

  sqlparse           conda-forge::sqlparse-0.4.1-pyh9f0ad1~ --> pkgs/main::sqlparse-0.4.1-py_0

The following packages will be DOWNGRADED:

  backports.tempfile                               1.0-py_1 --> 1.0-pyhd3eb1b0_1



Downloading and Extracting Packages

sqlparse-0.4.1       | 35 KB     |            |   0%
sqlparse-0.4.1       | 35 KB     | ####5      |  46%
sqlparse-0.4.1       | 35 KB     | ########## | 100%
sqlparse-0.4.1       | 35 KB     | ########## | 100%

conda-package-handli | 721 KB    |            |   0%
conda-package-handli | 721 KB    | #5         |  16%
conda-package-handli | 721 KB    | ########4  |  84%
conda-package-handli | 721 KB    | ########## | 100%

backports.functools_ | 9 KB      |            |   0%
backports.functools_ | 9 KB      | ########## | 100%
backports.functools_ | 9 KB      | ########## | 100%

backports.tempfile-1 | 11 KB     |            |   0%
backports.tempfile-1 | 11 KB     | ########## | 100%

conda-4.10.1         | 2.9 MB    |            |   0%
conda-4.10.1         | 2.9 MB    | #7         |  17%
conda-4.10.1         | 2.9 MB    | #####1     |  52%
conda-4.10.1         | 2.9 MB    | #########1 |  92%
conda-4.10.1         | 2.9 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

In [8]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [16]:
%%sql
SELECT *
    FROM facts
    LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

Minimum population
Maximum population
Minimum population growth
Maximum population growth

In [17]:
%%sql
SELECT MIN(population),MAX(population),MIN(population_growth),MAX(population_growth)
    FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [23]:

%%sql
SELECT *
    FROM facts
    WHERE population=0;

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [24]:
%%sql
SELECT *
    FROM facts
    WHERE population=(SELECT MIN(population)
                         FROM facts)

 * sqlite:///factbook.db
Done.

[(250, 'ay', 'Antarctica', None, 280000, None, 0, None, None, None, None)]

In [25]:


%%sql
SELECT *
  FROM facts
 WHERE population == (SELECT MAX(population)
                        FROM facts
                     );

 * sqlite:///factbook.db
Done.

[(261, 'xx', 'World', None, None, None, 7256490011, 1.08, 18.6, 7.8, None)]

## exclude the row of the whole world

In [37]:

%%sql
SELECT MIN(population) min_pop,MAX(population) max_pop,MIN(population_growth) min_pop_growth,MAX(population_growth) max_pop_growth
    FROM facts
    WHERE name <>'World';

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [38]:
%%sql
SELECT AVG(population),AVG(area)
    FROM facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

The population is above average.
The area is below average.

In [42]:
%%sql
SELECT *
    FROM facts
    WHERE population >(SELECT AVG(population)
                          FROM facts
                           WHERE name <>'World'
                      )
    AND area<(SELECT AVG(area)
                 FROM facts
                 WHERE name <>'World')

 * sqlite:///factbook.db
Done.

[(14, 'bg', 'Bangladesh', 148460, 130170, 18290, 168957745, 1.6, 21.14, 5.61, 0.46),
 (65, 'gm', 'Germany', 357022, 348672, 8350, 80854408, 0.17, 8.47, 11.42, 1.24),
 (80, 'iz', 'Iraq', 438317, 437367, 950, 37056169, 2.93, 31.45, 3.77, 1.62),
 (83, 'it', 'Italy', 301340, 294140, 7200, 61855120, 0.27, 8.74, 10.19, 4.1),
 (85, 'ja', 'Japan', 377915, 364485, 13430, 126919659, 0.16, 7.93, 9.51, 0.0),
 (91, 'ks', 'Korea, South', 99720, 96920, 2800, 49115196, 0.14, 8.19, 6.75, 0.0),
 (120, 'mo', 'Morocco', 446550, 446300, 250, 33322699, 1.0, 18.2, 4.81, 3.36),
 (138, 'rp', 'Philippines', 300000, 298170, 1830, 100998376, 1.61, 24.27, 6.11, 2.09),
 (139, 'pl', 'Poland', 312685, 304255, 8430, 38562189, 0.09, 9.74, 10.19, 0.46),
 (163, 'sp', 'Spain', 505370, 498980, 6390, 48146134, 0.89, 9.64, 9.04, 8.31),
 (173, 'th', 'Thailand', 513120, 510890, 2230, 67976405, 0.34, 11.19, 7.8, 0.0),
 (182, 'ug', 'Uganda', 241038, 197100, 43938, 37101745, 3.24, 43.79, 10.69, 0.74),
 (185, 'uk', 'United Kingdom', 243610, 241930, 1680, 64088222, 0.54, 12.17, 9.35, 2.54),
 (192, 'vm', 'Vietnam', 331210, 310070, 21140, 94348835, 0.97, 15.96, 5.93, 0.3)]